Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: The Provider processes Personal Data until all obligations arising from the Contract are fulfilled. At the moment of account closure by the Provider and/or account cancellation by the User, all Personal Data and other data entered into the Service will be deleted, except for selected Personal Data mentioned below; the Provider therefore <strong>strongly recommends backing up</strong> all data entered into the Service before cancelling the User account and is not responsible for their loss after the User account is closed, even if it is rightfully closed by the Provider. Personal Data indicated on invoices is retained by the Provider for at least the statutory retention periods arising from the law, i.e., for a period of 10 years. In cases where it is necessary for the defence of the Provider's claims and/or for defence against claims from third parties (including any proceedings initiated by public authorities), the Provider may also retain some other Personal Data, but always for a maximum period equal to the limitation period for individual claims and/or until the final conclusion of selected proceedings. The specific duration cannot be precisely defined and varies according to the type of claim, their limitation periods, and the pace of selected courts or public authorities. Data that the Provider processes only as a processor of the User's data is processed for the period specified by the User's instructions unless the Provider has another legal basis for processing personal data as a controller under Article 2.1 of this Policy.
sv: LeverantÃ¶ren behandlar personuppgifter tills alla skyldigheter som fÃ¶ljer av avtalet har fullgjorts. NÃ¤r leverantÃ¶ren stÃ¤nger kontot och/eller anvÃ¤ndaren avslutar kontot raderas alla personuppgifter och andra uppgifter som har matats in i tjÃ¤nsten, med undantag fÃ¶r vissa personuppgifter som anges nedan. LeverantÃ¶ren <strong>rekommenderar</strong> dÃ¤rfÃ¶r <strong>starkt att</strong> alla uppgifter som har matats in i tjÃ¤nsten <strong>sÃ¤kerhetskopieras</strong> innan anvÃ¤ndarkontot avslutas och ansvarar inte fÃ¶r fÃ¶rlust av dessa uppgifter efter att anvÃ¤ndarkontot har stÃ¤ngts, Ã¤ven om det har stÃ¤ngts pÃ¥ rÃ¤tt sÃ¤tt av leverantÃ¶ren. Personuppgifter som anges pÃ¥ fakturor behÃ¥lls av leverantÃ¶ren under minst den lagstadgade lagringstiden, dvs. under en period av 10 Ã¥r. I fall dÃ¤r det Ã¤r nÃ¶dvÃ¤ndigt fÃ¶r att fÃ¶rsvara leverantÃ¶rens ansprÃ¥k och/eller fÃ¶r att fÃ¶rsvara sig mot ansprÃ¥k frÃ¥n tredje part (inklusive eventuella fÃ¶rfaranden som inletts av offentliga myndigheter) kan leverantÃ¶ren ocksÃ¥ behÃ¥lla vissa andra personuppgifter, men alltid under en maximal period som motsvarar preskriptionstiden fÃ¶r enskilda ansprÃ¥k och/eller tills det slutliga avgÃ¶randet av utvalda fÃ¶rfaranden. Den specifika varaktigheten kan inte definieras exakt och varierar beroende pÃ¥ typen av ansprÃ¥k, deras preskriptionstider och takten hos utvalda domstolar eller offentliga myndigheter. Uppgifter som leverantÃ¶ren endast behandlar som personuppgiftsbitrÃ¤de fÃ¶r anvÃ¤ndarens uppgifter behandlas under den period som anges i anvÃ¤ndarens instruktioner, sÃ¥vida inte leverantÃ¶ren har en annan rÃ¤ttslig grund fÃ¶r att behandla personuppgifter som personuppgiftsansvarig enligt artikel 2.1 i denna policy.

source: The Provider may also process selected Personal Data of the User, particularly email, first name, last name, and any other personal data (if provided for these purposes) based on the <strong>voluntary and informed</strong> consent of the User. Processing occurs for a period of <strong>2 years</strong> and/or until the consent is revoked. The use of the Service or Product (including Support Services) is <strong>never</strong> conditioned on the provision of consent. Consent is, however, typically required for sending newsletters to data subjects who are not yet Users, or for providing selected bonuses or bonus materials not linked to other services of the Provider and/or for the disclosure of the User's Personal Data in connection with a donation made to the Provider. Revocation can be made at any time directly in the User account interface and, in the case of consent granted otherwise, by sending a request toÂ <a href="mailto:%(address)s">%(address)s</a>.
sv: LeverantÃ¶ren kan ocksÃ¥ behandla utvalda personuppgifter om anvÃ¤ndaren, sÃ¤rskilt e-postadress, fÃ¶rnamn, efternamn och andra personuppgifter (om sÃ¥dana lÃ¤mnats fÃ¶r dessa Ã¤ndamÃ¥l) pÃ¥ grundval av anvÃ¤ndarens <strong>frivilliga och informerade</strong> samtycke. Behandlingen sker under en period av <strong>tvÃ¥ Ã¥r</strong> och/eller tills samtycket Ã¥terkallas. AnvÃ¤ndningen av tjÃ¤nsten eller produkten (inklusive supporttjÃ¤nster) Ã¤r <strong>aldrig</strong> villkorad av att samtycke lÃ¤mnas. Samtycke krÃ¤vs dock vanligtvis fÃ¶r att skicka nyhetsbrev till registrerade som Ã¤nnu inte Ã¤r anvÃ¤ndare, eller fÃ¶r att tillhandahÃ¥lla utvalda bonusar eller bonusmaterial som inte Ã¤r kopplade till leverantÃ¶rens andra tjÃ¤nster och/eller fÃ¶r att lÃ¤mna ut anvÃ¤ndarens personuppgifter i samband med en donation till leverantÃ¶ren. Ã terkallandet kan gÃ¶ras nÃ¤r som helst direkt i anvÃ¤ndarkontots grÃ¤nssnitt och, i fall av samtycke som beviljats pÃ¥ annat sÃ¤tt, genom att skicka en begÃ¤ran till<a href="mailto:%(address)s">%(address)s</a>.

source: Once the reason for processing Personal Data has passed, the Provider will destroy the Personal Data. This does not exclude the further processing of selected Personal Data based on a different legal reason if this legal reason in favour of the Provider continues to exist.
sv: NÃ¤r skÃ¤let fÃ¶r behandlingen av personuppgifter har upphÃ¶rt kommer leverantÃ¶ren att fÃ¶rstÃ¶ra personuppgifterna. Detta utesluter inte vidare behandling av utvalda personuppgifter pÃ¥ grundval av ett annat rÃ¤ttsligt skÃ¤l, om detta rÃ¤ttsliga skÃ¤l till fÃ¶rmÃ¥n fÃ¶r leverantÃ¶ren fortsÃ¤tter att fÃ¶religga.

source: Recipients and Processors of Personal Data
sv: Mottagare och behandlare av personuppgifter

source: In addition to the Provider, selected third parties also receive and process personal data based on this Policy, whose involvement is necessary for the proper processing of Personal Data for the purposes defined in Article 2.1 of this Policy, specifically:
sv: FÃ¶rutom leverantÃ¶ren mottar och behandlar Ã¤ven utvalda tredje parter personuppgifter i enlighet med denna policy, vars medverkan Ã¤r nÃ¶dvÃ¤ndig fÃ¶r korrekt behandling av personuppgifter fÃ¶r de Ã¤ndamÃ¥l som definieras i artikel 2.1 i denna policy, nÃ¤rmare bestÃ¤mt:

source: hosting provider (including web hosting and mail hosting services), currently this is <strong>Hetzner Online GmbH</strong>;
sv: webbhotellleverantÃ¶r (inklusive webbhotell- och e-posthotellstjÃ¤nster), fÃ¶r nÃ¤rvarande <strong>Hetzner Online GmbH</strong>;

source: operators of the payment gateway <strong>ThePay.cz, s.r.o.</strong> and possibly operators of other services used in connection with the payment of any payments related to billing;
sv: operatÃ¶rer av betalningsgatewayen <strong>ThePay.cz, s.r.o.</strong> och eventuellt operatÃ¶rer av andra tjÃ¤nster som anvÃ¤nds i samband med betalning av fakturering;

source: accounting, legal, and tax advisors of the Provider and possibly other persons bound by confidentiality under the law;
sv: leverantÃ¶rens redovisnings-, juridiska och skatterÃ¥dgivare samt eventuellt andra personer som Ã¤r bundna av sekretess enligt lag;

source: C-level and other managerial employees employed by or otherwise collaborating with the Provider;
sv: C-nivÃ¥ och andra chefer som Ã¤r anstÃ¤llda av eller pÃ¥ annat sÃ¤tt samarbetar med leverantÃ¶ren;

source: selected contractors of the Provider who are involved in providing services to Users and who are also bound by confidentiality;
sv: utvalda uppdragstagare till leverantÃ¶ren som Ã¤r involverade i att tillhandahÃ¥lla tjÃ¤nster till anvÃ¤ndare och som ocksÃ¥ Ã¤r bundna av sekretess;

source: any other persons whose involvement is necessary for the proper provision of the Service, Products, Support Services, and/or to ensure any other activities related to the above;
sv: alla andra personer vars medverkan Ã¤r nÃ¶dvÃ¤ndig fÃ¶r att tjÃ¤nsten, produkterna, supporttjÃ¤nsterna och/eller andra aktiviteter relaterade till ovanstÃ¥ende ska kunna tillhandahÃ¥llas pÃ¥ ett korrekt sÃ¤tt;

source: the persons mentioned in this Article 3.1 are collectively referred to in this Policy as "<strong>Processors</strong>".
sv: de personer som nÃ¤mns i denna artikel 3.1 benÃ¤mns gemensamt i denna policy som "<strong>personuppgiftsbitrÃ¤den</strong>".

source: The User agrees that the Provider may transfer personal data to the aforementioned Processors if this is necessary to fulfil the above purposes of data processing. The Processors that the Provider engages for processing personal data must meet high standards of protection and will always handle the data within the limits of the GDPR and this Policy.
sv: AnvÃ¤ndaren samtycker till att leverantÃ¶ren fÃ¥r Ã¶verfÃ¶ra personuppgifter till ovannÃ¤mnda personuppgiftsbitrÃ¤den om detta Ã¤r nÃ¶dvÃ¤ndigt fÃ¶r att uppfylla ovanstÃ¥ende syften med personuppgiftsbehandlingen. De personuppgiftsbitrÃ¤den som leverantÃ¶ren anlitar fÃ¶r behandling av personuppgifter mÃ¥ste uppfylla hÃ¶ga skyddskrav och kommer alltid att hantera uppgifterna inom ramen fÃ¶r GDPR och denna policy.

source: The Personal Data might be disclosed to third parties in limited circumstances when the Controller has a good faith belief it is required by law, such as under a subpoena or other judicial or administrative order. In case the Controller is required by law to disclose the Personal Data, an attempt will be made to provide the User with prior notice by e-mail (unless the Controller is prohibited, or it would be futile) that a request for the Personal Data has been made to allow the User to object to the disclosure.
sv: Personuppgifterna kan lÃ¤mnas ut till tredje part under begrÃ¤nsade omstÃ¤ndigheter nÃ¤r den registeransvarige i god tro anser att det krÃ¤vs enligt lag, till exempel vid en stÃ¤mning eller annan rÃ¤ttslig eller administrativ order. Om den registeransvarige enligt lag Ã¤r skyldig att lÃ¤mna ut personuppgifterna kommer ett fÃ¶rsÃ¶k att gÃ¶ras att i fÃ¶rvÃ¤g meddela anvÃ¤ndaren via e-post (om inte den registeransvarige Ã¤r fÃ¶rbjuden att gÃ¶ra detta eller om det skulle vara meningslÃ¶st) att en begÃ¤ran om personuppgifterna har gjorts, sÃ¥ att anvÃ¤ndaren kan invÃ¤nda mot utlÃ¤mnandet.

source: The processing of Personal Data by selected Processors may be governed by their own service provision conditions.
sv: Behandlingen av personuppgifter av utvalda personuppgiftsbitrÃ¤den kan regleras av deras egna villkor fÃ¶r tillhandahÃ¥llande av tjÃ¤nster.

source: Personal Data may also be transferred if the Provider is obliged to do so by law, as a result of a decision by a public authority, or in other cases where the transfer must occur in compliance with the obligations of the Provider arising from generally binding regulations.
sv: Personuppgifter kan ocksÃ¥ Ã¶verfÃ¶ras om leverantÃ¶ren Ã¤r skyldig att gÃ¶ra det enligt lag, till fÃ¶ljd av ett beslut av en offentlig myndighet eller i andra fall dÃ¤r Ã¶verfÃ¶ringen mÃ¥ste ske i enlighet med leverantÃ¶rens skyldigheter som fÃ¶ljer av allmÃ¤nt bindande bestÃ¤mmelser.

source: Common Provisions on Processing
sv: Gemensamma bestÃ¤mmelser om behandling

source: The Provider will always make every effort to prevent unauthorized processing of personal data by other persons; however, it is not liable to the User or other data subjects for any damages caused by unauthorized processing of personal data by any third party, even if those third parties are Processors.
sv: LeverantÃ¶ren kommer alltid att gÃ¶ra sitt yttersta fÃ¶r att fÃ¶rhindra obehÃ¶rig behandling av personuppgifter av andra personer. LeverantÃ¶ren Ã¤r dock inte ansvarig gentemot anvÃ¤ndaren eller andra registrerade fÃ¶r skador som orsakas av obehÃ¶rig behandling av personuppgifter av tredje part, Ã¤ven om dessa tredje parter Ã¤r personuppgiftsbitrÃ¤den.

source: Emails sent to Users in connection with the provision of the Service, Product, and/or Support Services are not considered unsolicited commercial communications under Act No. 40/1995 Coll. on Advertising and Act No. 480/2004 Coll. on Certain Information Society Services, if they directly relate to these Services, Products, and/or Support Services.
sv: E-postmeddelanden som skickas till anvÃ¤ndare i samband med tillhandahÃ¥llandet av tjÃ¤nsten, produkten och/eller supporttjÃ¤nsterna betraktas inte som oÃ¶nskad kommersiell kommunikation enligt lag nr 40/1995 Coll. om reklam och lag nr 480/2004 Coll. om vissa informationssamhÃ¤llstjÃ¤nster, om de direkt avser dessa tjÃ¤nster, produkter och/eller supporttjÃ¤nster.

source: The User may, however, explicitly and <strong>voluntarily consent</strong>, within the meaning of Section 7(2) of Act No. 480/2004 Coll. on Certain Information Society Services and amending certain acts, to receive broader commercial communications (e.g., in the case of indirect marketing) from the Provider at the User's electronic address. This consent can, of course, be revoked at any time by clicking on the link found in the footer of such commercial communication.
sv: AnvÃ¤ndaren kan dock uttryckligen och <strong>frivilligt</strong>, i enlighet med avsnitt 7(2) i lag nr 480/2004 Coll. om vissa informationssamhÃ¤llstjÃ¤nster och Ã¤ndring av vissa lagar, <strong>samtycka till</strong> att ta emot mer omfattande kommersiell kommunikation (t.ex. i fallet med indirekt marknadsfÃ¶ring) frÃ¥n leverantÃ¶ren till anvÃ¤ndarens elektroniska adress. Detta samtycke kan naturligtvis Ã¥terkallas nÃ¤r som helst genom att klicka pÃ¥ lÃ¤nken i sidfoten i sÃ¥dan kommersiell kommunikation.

source: In the event that the Provider and/or Processors learn of a security risk related to Personal Data that affects the User, they will notify the User of this fact without undue delay.
sv: Om leverantÃ¶ren och/eller personuppgiftsbitrÃ¤dena fÃ¥r kÃ¤nnedom om en sÃ¤kerhetsrisk relaterad till personuppgifter som pÃ¥verkar anvÃ¤ndaren, kommer de att underrÃ¤tta anvÃ¤ndaren om detta utan onÃ¶digt drÃ¶jsmÃ¥l.

source: The Provider will provide the User with assistance and legal help in seeking compensation from responsible Processors in the event of a data breach or other incident leading to loss. However, the Provider is not responsible for the improper actions of the Processors.
sv: LeverantÃ¶ren kommer att ge anvÃ¤ndaren assistans och juridisk hjÃ¤lp vid ansÃ¶kan om ersÃ¤ttning frÃ¥n ansvariga personuppgiftsbitrÃ¤den i hÃ¤ndelse av ett dataintrÃ¥ng eller annan incident som leder till fÃ¶rlust. LeverantÃ¶ren ansvarar dock inte fÃ¶r personuppgiftsbitrÃ¤dens olÃ¤mpliga handlingar.

source: The User hereby confirms that the provided Personal Data is true, accurate, and relates solely to the User, or that they have provided data the use of which does not violate the rights of third parties. The User is obliged to always inform the Provider of any changes to their Personal Data so that only current and complete data is processed. The same obligations apply to the User in the case where they provide the Provider with Personal Data of data subjects other than this User.
sv: AnvÃ¤ndaren bekrÃ¤ftar hÃ¤rmed att de tillhandahÃ¥llna personuppgifterna Ã¤r sanna, korrekta och endast avser anvÃ¤ndaren, eller att de har tillhandahÃ¥llit uppgifter vars anvÃ¤ndning inte krÃ¤nker tredje parts rÃ¤ttigheter. AnvÃ¤ndaren Ã¤r skyldig att alltid informera leverantÃ¶ren om eventuella Ã¤ndringar av sina personuppgifter sÃ¥ att endast aktuella och fullstÃ¤ndiga uppgifter behandlas. Samma skyldigheter gÃ¤ller fÃ¶r anvÃ¤ndaren i de fall dÃ¥ denne tillhandahÃ¥ller leverantÃ¶ren personuppgifter om andra registrerade Ã¤n denna anvÃ¤ndare.

source: Personal Data will be processed electronically, including the use of automated processing methods. However, the User or other data subjects will never be subject to individual automated decision-making (including profiling) within the meaning of Article 22 of the GDPR.
sv: Personuppgifter kommer att behandlas elektroniskt, inklusive anvÃ¤ndning av automatiserade behandlingsmetoder. AnvÃ¤ndaren eller andra registrerade kommer dock aldrig att bli fÃ¶remÃ¥l fÃ¶r individuella automatiserade beslut (inklusive profilering) i den mening som avses i artikel 22 i GDPR.

source: Anonymized personal data (which are no longer considered personal data under the GDPR) may be processed even after all legal grounds for processing the User's Personal Data have ceased.
sv: Anonymiserade personuppgifter (som inte lÃ¤ngre betraktas som personuppgifter enligt GDPR) fÃ¥r behandlas Ã¤ven efter det att alla rÃ¤ttsliga grunder fÃ¶r behandling av anvÃ¤ndarens personuppgifter har upphÃ¶rt.

source: User Rights in Relation to Personal Data
sv: AnvÃ¤ndarens rÃ¤ttigheter avseende personuppgifter

source: The User can exercise their rights arising from the GDPR at any time by sending an email toÂ <a href="mailto:%(address)s">%(address)s</a>, as well as through their User Account, since the implementation of most of the rights listed below (especially access to all processed Personal Data, their correction, restriction, or deletion) can be automated through this user account.
sv: AnvÃ¤ndaren kan nÃ¤r som helst utÃ¶va sina rÃ¤ttigheter enligt GDPR genom att skicka ett e-postmeddelande till<a href="mailto:%(address)s">%(address)s</a> eller via sitt anvÃ¤ndarkonto, eftersom de flesta av de rÃ¤ttigheter som anges nedan (sÃ¤rskilt tillgÃ¥ng till alla behandlade personuppgifter, rÃ¤ttelse, begrÃ¤nsning eller radering) kan automatiseras via detta anvÃ¤ndarkonto.

source: The Provider will make every effort to address requests regarding the User's personal data as soon as possible, but no later than within <strong>30 days</strong>, unless due to the complexity of the matter it is necessary for the Provider to extend this period. The User's rights include:
sv: LeverantÃ¶ren kommer att gÃ¶ra allt fÃ¶r att behandla fÃ¶rfrÃ¥gningar angÃ¥ende anvÃ¤ndarens personuppgifter sÃ¥ snart som mÃ¶jligt, dock senast inom <strong>30 dagar</strong>, sÃ¥vida inte komplexiteten i Ã¤rendet gÃ¶r det nÃ¶dvÃ¤ndigt fÃ¶r leverantÃ¶ren att fÃ¶rlÃ¤nga denna period. AnvÃ¤ndarens rÃ¤ttigheter omfattar:

source: an explanation of whether and what personal data is being processed and, if applicable, requesting the Provider to disclose it;
sv: en fÃ¶rklaring om huruvida och vilka personuppgifter som behandlas och, i fÃ¶rekommande fall, begÃ¤ra att leverantÃ¶ren lÃ¤mnar ut dem;

source: correction of personal data if there is concern that some of it is inaccurate or missing;
sv: korrigering av personuppgifter om det finns anledning att tro att vissa uppgifter Ã¤r felaktiga eller saknas;

source: restriction of processing if there is concern that the Provider is processing more data than necessary;
sv: begrÃ¤nsning av behandlingen om det finns anledning att tro att leverantÃ¶ren behandlar mer data Ã¤n nÃ¶dvÃ¤ndigt;

source: deletion of personal data based on the consent of the Provider, provided that there is no other legal reason for further processing of personal data;
sv: radering av personuppgifter baserat pÃ¥ leverantÃ¶rens samtycke, fÃ¶rutsatt att det inte finns nÃ¥gon annan rÃ¤ttslig grund fÃ¶r vidare behandling av personuppgifter;

source: issuance of a copy of the personal data processed by automated means based on the consent of the Provider or in connection with fulfilling the Provider's contractual obligations, in a machine-readable format;
sv: utfÃ¤rdande av en kopia av de personuppgifter som behandlas automatiskt pÃ¥ grundval av leverantÃ¶rens samtycke eller i samband med fullgÃ¶randet av leverantÃ¶rens avtalsenliga skyldigheter, i ett maskinlÃ¤sbart format;

source: temporary freezing of data processing operations for the purposes of the legitimate interest of the Provider;
sv: tillfÃ¤llig frysning av databehandling fÃ¶r leverantÃ¶rens berÃ¤ttigade intressen;

source: filing a complaint directly with the Office for Personal Data Protection (<a href="%(url)s">%(url)s</a>) or another relevant national data protection authority if the User believes that the Provider is processing personal data in violation of this Policy or legal regulations.
sv: lÃ¤mna in ett klagomÃ¥l direkt till myndigheten fÃ¶r skydd av personuppgifter (<a href="%(url)s">%(url)s)</a> eller annan relevant nationell dataskyddsmyndighet om anvÃ¤ndaren anser att leverantÃ¶ren behandlar personuppgifter i strid med denna policy eller lagstadgade bestÃ¤mmelser.

source: Final Provisions
sv: SlutbestÃ¤mmelser

source: The Provider is entitled to unilaterally change the Policy. The new wording of the Policy becomes effective upon publication on the Website. The User, who has a contractual relationship with the Provider governed by this Policy at the time of the change, will receive a notification of the change in the Policy displayed within the Service, or upon the next first login to their User Account.
sv: LeverantÃ¶ren har rÃ¤tt att ensidigt Ã¤ndra policyn. Den nya formuleringen av policyn trÃ¤der i kraft vid publicering pÃ¥ webbplatsen. AnvÃ¤ndaren, som har ett avtalsfÃ¶rhÃ¥llande med leverantÃ¶ren som regleras av denna policy vid tidpunkten fÃ¶r Ã¤ndringen, kommer att fÃ¥ ett meddelande om Ã¤ndringen i policyn som visas inom tjÃ¤nsten eller vid nÃ¤sta inloggning pÃ¥ sitt anvÃ¤ndarkonto.

source: All legal relationships between the Provider and the User arising from this Policy are governed by the valid laws of the Czech Republic. Any disputes arising between the Provider and the User from or in connection with this Policy will be resolved before the competent civil court in the Czech Republic.
sv: Alla rÃ¤ttsliga fÃ¶rhÃ¥llanden mellan leverantÃ¶ren och anvÃ¤ndaren som uppstÃ¥r till fÃ¶ljd av denna policy regleras av gÃ¤llande lagstiftning i Tjeckien. Eventuella tvister mellan leverantÃ¶ren och anvÃ¤ndaren som uppstÃ¥r till fÃ¶ljd av eller i samband med denna policy ska lÃ¶sas av behÃ¶rig civil domstol i Tjeckien.

source: If the relationship established by the Contract contains an international (foreign) element, the choice of law according to the previous sentence does not deprive the User â Consumer of the protection provided by provisions of the legal order that cannot be contractually deviated from and which would otherwise apply in the absence of a choice of law in accordance with the provisions of Article 6(1) of the Regulation of the European Parliament and Council (EC) No. 593/2008 of June 17, 2008, on the law applicable to contractual obligations (Rome I).
sv: Om det fÃ¶rhÃ¥llande som upprÃ¤ttas genom avtalet innehÃ¥ller ett internationellt (utlÃ¤ndskt) inslag, berÃ¶var inte valet av lag enligt fÃ¶regÃ¥ende mening anvÃ¤ndaren â Konsumenten frÃ¥n det skydd som ges av bestÃ¤mmelser i den rÃ¤ttsordning som inte kan avvikas frÃ¥n i avtalet och som annars skulle gÃ¤lla i avsaknad av ett lagval i enlighet med bestÃ¤mmelserna i artikel 6.1 i Europaparlamentets och rÃ¥dets fÃ¶rordning (EG) nr 593/2008 av den 17 juni 2008 om tillÃ¤mplig lag fÃ¶r avtalsfÃ¶rpliktelser (Rom I).

source: If any provision of the Policy is invalid or ineffective, or becomes so, the provision with meaning most closely approximates the invalid provision will replace the invalid provisions. The invalidity or ineffectiveness of one provision does not affect the validity of the other provisions of this Policy.
sv: Om nÃ¥gon bestÃ¤mmelse i policyn Ã¤r ogiltig eller verkningslÃ¶s, eller blir det, ska den bestÃ¤mmelse som mest liknar den ogiltiga bestÃ¤mmelsen ersÃ¤tta den ogiltiga bestÃ¤mmelsen. Ogiltigheten eller verkningslÃ¶sheten hos en bestÃ¤mmelse pÃ¥verkar inte giltigheten hos de Ã¶vriga bestÃ¤mmelserna i denna policy.
